app/controllers/techniques_controller.rb

SELECT "techniques".* FROM "techniques"
---
  def index
    @techniques = Technique.all